      IDENTIFICATION DIVISION.
      PROGRAM-ID. HELLO-WORLD.
      ENVIRONMENT DIVISION.
      DATA DIVISION.
      FILE SECTION.
      WORKING-STORAGE SECTION.
      01 WS-NAME PIC X(20).
      PROCEDURE DIVISION.
      MAIN-LOGIC SECTION.
      0000-MAIN.
          PERFORM GREET-USER
          CALL "SUB-PROG" USING WS-NAME
          GOBACK
          .
      GREET-USER.
          DISPLAY "HELLO"
          .
      *    PERFORM OLD-ROUTINE.
      *    CALL DEAD-CODE.
